app/controllers/comments_controller.rb

SELECT "labs".* FROM "labs" WHERE "labs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def new
    @lab= Lab.find(params[:lab_id])

SELECT "labs".* FROM "labs" WHERE "labs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "post_id", "parent_id", "created_at", "updated_at", "lab_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["body", "hrthr"], ["post_id", nil], ["parent_id", nil], ["created_at", "2024-03-24 13:31:46.318105"], ["updated_at", "2024-03-24 13:31:46.318105"], ["lab_id", 1]]
---
  def create
    @lab = Lab.find(params[:lab_id])
    @comment = @lab.comments.new(comment_params)

    respond_to do |format|
      if @comment.save