app/controllers/labs_controller.rb

  def index
    @labs = Lab.all
---
SELECT "labs".* FROM "labs"

  def create
    @lab = Lab.new(lab_params)

    respond_to do |format|
      if @lab.save
---
INSERT INTO "labs" ("title", "body", "created_at", "updated_at", "ocenka", "user_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", "kmlnjbu"], ["body", "5676fguhi0jopm["], ["created_at", "2024-03-24 09:06:28.447677"], ["updated_at", "2024-03-24 09:06:28.447677"], ["ocenka", "A"], ["user_id", 2]]

  def update
    respond_to do |format|
      if @lab.update(lab_params)
---
UPDATE "labs" SET "updated_at" = ?, "ocenka" = ? WHERE "labs"."id" = ?  [["updated_at", "2024-03-17 10:10:01.979737"], ["ocenka", "B"], ["id", 5]]

  def destroy
    @lab.destroy!
---
DELETE FROM "labs" WHERE "labs"."id" = ?  [["id", 2]]

    def set_lab
      @lab = Lab.find(params[:id])
---
SELECT "labs".* FROM "labs" WHERE "labs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]