app/controllers/labs_controller.rb

  def show
    @laba=Lab.find(params[:id])
---
SELECT "labs".* FROM "labs" WHERE "labs"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]