app/models/user.rb

  def self.find_for_database_authentication warden_condition
    conditions = warden_condition.dup
    login = conditions.delete(:login)
    where(conditions).where(
      ["lower(username) = :value OR lower(email) = :value",
      { value: login.strip.downcase}]).first
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "1@rt.ru"], ["LIMIT", 1]]